---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.PointClouds.IPointCloudEngine
source: html/b3f15ac0-3258-b462-387a-3aaa98259ec3.htm
---
# IPointCloudEngine Members

Implement this method to construct the IPointCloudAccess interface for the point cloud designated by
 the identifier. This method is called once during the creation of a PointCloudType.